src/cf/Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ДополнительныеНачисления</xr:Item>
				<xr:Item>CalculationRegister.ОсновныеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисления</v8:Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>График</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Графики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисления</v8:Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CalculationRegisters/ОсновныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<CalculationRegister>
		<Properties>
			<Name>ОсновныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>false</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/cf/CalculationRegisters/ДополнительныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<CalculationRegister>
		<Properties>
			<Name>ДополнительныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ТарифныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСтавки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/НачислениеЗарплаты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОсновныеНачисления.Записывать = Истина;
	Движения.ДополнительныеНачисления.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НачислениеЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник,
	               |	НачислениеЗарплатыОсновныеНачисления.Подразделение КАК Подразделение,
	               |	НачислениеЗарплатыОсновныеНачисления.ВидРасчета,
	               |	НачислениеЗарплатыОсновныеНачисления.График,
	               |	НачислениеЗарплатыОсновныеНачисления.ДатаНачала,
	               |	НачислениеЗарплатыОсновныеНачисления.ДатаОкончания
	               |ПОМЕСТИТЬ ТЧ_Осн
	               |ИЗ
	               |	Документ.НачислениеЗарплаты.ОсновныеНачисления КАК НачислениеЗарплатыОсновныеНачисления
	               |ГДЕ
	               |	НачислениеЗарплатыОсновныеНачисления.Ссылка = &Ссылка
	               |	И НачислениеЗарплатыОсновныеНачисления.ВидРасчета = &ВидРасчетаТариф
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Сотрудник,
	               |	Подразделение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ПериодРегистрации,
	               |	ТЧ_Осн.Сотрудник,
	               |	ТЧ_Осн.Подразделение,
	               |	ТЧ_Осн.ВидРасчета,
	               |	ТЧ_Осн.График,
	               |	ТЧ_Осн.ДатаНачала КАК ПериодДействияНачало,
	               |	ТЧ_Осн.ДатаОкончания КАК ПериодДействияКонец,
	               |	ЕСТЬNULL(ТарифныеСтавкиСрезПоследних.Ставка, 0) КАК Тариф
	               |ИЗ
	               |	ТЧ_Осн КАК ТЧ_Осн
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавки.СрезПоследних(&ПериодРегистрации, ) КАК ТарифныеСтавкиСрезПоследних
	               |		ПО ТЧ_Осн.График = ТарифныеСтавкиСрезПоследних.График
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ПериодРегистрации,
	               |	НачислениеЗарплатыДополнительрныеНачисления.Сотрудник,
	               |	НачислениеЗарплатыДополнительрныеНачисления.Подразделение,
	               |	НачислениеЗарплатыДополнительрныеНачисления.ВидРасчета,
				   |	НачислениеЗарплатыДополнительрныеНачисления.Процент,
	               |	ДОБАВИТЬКДАТЕ(&ПериодРегистрации, МЕСЯЦ, -1) КАК БазовыйПериодНачало,
	               |	ДОБАВИТЬКДАТЕ(&ПериодРегистрации, СЕКУНДА, -1) КАК БазовыйПериодКонец
	               |ИЗ
	               |	Документ.НачислениеЗарплаты.ДополнительныеНачисления КАК НачислениеЗарплатыДополнительрныеНачисления
	               |ГДЕ
	               |	НачислениеЗарплатыДополнительрныеНачисления.Ссылка = &Ссылка
	               |	И НачислениеЗарплатыДополнительрныеНачисления.ВидРасчета = &ВидРасчетаПремия";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаТариф", ПланыВидовРасчета.ОсновныеНачисления.Тариф);
	Запрос.УстановитьПараметр("ВидРасчетаПремия", ПланыВидовРасчета.ДополнительныеНачисления.Премия);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Дата));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Если Не МассивРезультатов[1].Пустой() Тогда 
		Движения.ОсновныеНачисления.Загрузить(МассивРезультатов[1].Выгрузить());
	КонецЕсли;
	
	Если Не МассивРезультатов[2].Пустой() Тогда 
		Движения.ДополнительныеНачисления.Загрузить(МассивРезультатов[2].Выгрузить());
	КонецЕсли;
	
	Движения.Записать();	
	
	Расчет();
	
КонецПроцедуры

Процедура Расчет()
	
	СтруктураПоиска = Новый Структура("НомерСтроки");
	
	Измерения = Новый Массив;
	Измерения.Добавить("Подразделение");
	
	Разрезы = Новый Массив;
	Разрезы.Добавить("Сотрудник");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Разрезы", Разрезы);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	               |	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК ЧасыФакт
	               |ИЗ
	               |	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор) КАК ОсновныеНачисленияДанныеГрафика
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = Движения.ОсновныеНачисления;
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл 
		СтруктураПоиска.НомерСтроки = ЗаписьНабора.НомерСтроки;
		Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда 
			ЗаписьНабора.Результат = Выборка.ЧасыФакт * ЗаписьНабора.Тариф;
		КонецЕсли;
		Выборка.Сбросить();
	КонецЦикла;
	НаборЗаписей.Записать(,Истина);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки,
	               |	СУММА(ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза) КАК База,
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.Процент
	               |ИЗ
	               |	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(&Измерения
				   |																	, 
				   |																	&Измерения
				   |																	, 
				   |																	&Разрезы
				   |																	, 
				   |																	Регистратор = &Регистратор
				   |	) КАК ДополнительныеНачисленияБазаОсновныеНачисления
	               |ГДЕ
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.Сотрудник <> ДополнительныеНачисленияБазаОсновныеНачисления.СотрудникРазрез
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки,
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.Процент";
	Выборка = Запрос.Выполнить().Выбрать();			   
	
	НаборЗаписей = Движения.ДополнительныеНачисления;
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл 
		СтруктураПоиска.НомерСтроки = ЗаписьНабора.НомерСтроки;
		Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда 
			ЗаписьНабора.Результат = Выборка.База * ЗаписьНабора.Процент / 100;
		КонецЕсли;
		Выборка.Сбросить();
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры
